=====================================
Math Expressions
=====================================

1 + x + 1
0xDEAD * x / 0.01
0xDEAD * (x / 0.01)

---

(source
  (expression_statement
    (binary_operator (binary_operator (integer) (identifier)) (integer)))
  (expression_statement
    (binary_operator (binary_operator (integer) (identifier)) (float)))
  (expression_statement
    (binary_operator (integer) (parenthesized_expression
      (binary_operator (identifier) (float))))))

=====================================
NodePath
=====================================

@"Node/Path"
@'Node/Path'
@ 'node/path'
var x = @"NodePath"

---

(source
  (expression_statement (node_path))
  (expression_statement (node_path))
  (ERROR (UNEXPECTED ' ')) (expression_statement (string))
  (variable_statement (identifier) (node_path)))


=====================================
Variables
=====================================

var x
var x = "hello"
var x := "hello"
var x: Type
var x: Type = "hello"

---

(source
  (variable_statement (identifier))
  (variable_statement (identifier) (string))
  (variable_statement (identifier) (inferred_type) (string))
  (variable_statement (identifier) (type (identifier)))
  (variable_statement (identifier) (type (identifier)) (string)))

=====================================
Variable Assign Expressions
=====================================

var x = 1 + x + 1

---

(source
  (variable_statement (identifier)
      (binary_operator (binary_operator (integer) (identifier)) (integer))))

=====================================
Export Variables
=====================================

export var a
export var a = "a"

export(Type) var a
export(Type) var a = "a"

export(Type, Param) var a
export(Type, "Param") var a = "a"

---

(source
  (export_variable_statement (identifier))
  (export_variable_statement (identifier) (string))
  (export_variable_statement (argument_list (identifier)) (identifier))
  (export_variable_statement (argument_list (identifier)) (identifier) (string))
  (export_variable_statement (argument_list (identifier) (identifier)) (identifier))
  (export_variable_statement (argument_list (identifier) (string)) (identifier) (string)))

=====================================
SetGet Variables
=====================================

var x setget setter,getter
var x setget setter
var x setget ,getter

---

(source
  (variable_statement (identifier) (setget (setter (identifier)) (getter (identifier))))
  (variable_statement (identifier) (setget (setter (identifier))))
  (variable_statement (identifier) (setget (getter (identifier))))
)

=====================================
Const Variables
=====================================

const CONST = 1
const CONST := 1
const CONST : int = 1

---

(source
  (const_statement (identifier) (integer))
  (const_statement (identifier) (inferred_type) (integer))
  (const_statement (identifier) (type (identifier)) (integer)))


=====================================
Invalid Variables
=====================================

var x = var y
var x :=

---

(source
  (variable_statement (identifier) (ERROR (identifier)) (identifier))
  (ERROR (identifier)  (inferred_type)))

=====================================
Function Definitions
=====================================

func hello():
  pass

func hello() -> Type:
  pass

func hello(param):
  pass

func hello(param) -> Type:
  pass

func hello(default_param="string"):
  pass

func hello(default_param="string") -> Type:
  pass

func hello(typed_param: Type):
  pass

func hello(typed_param: Type) -> Type:
  pass

func hello(typed_default_param: Type="string"):
  pass

func hello(typed_default_param: Type="string") -> Type:
  pass

---

(source
  (function_definition (identifier) (parameters)
    (body (pass_statement)))
  (function_definition (identifier) (parameters) (return_type (type (identifier)))
    (body (pass_statement)))
  (function_definition (identifier) (parameters (identifier))
    (body (pass_statement)))
  (function_definition (identifier) (parameters (identifier)) (return_type (type (identifier)))
    (body (pass_statement)))
  (function_definition (identifier) (parameters (default_parameter (identifier) (string)))
    (body (pass_statement)))
  (function_definition (identifier) (parameters (default_parameter (identifier) (string))) (return_type (type (identifier)))
    (body (pass_statement)))
  (function_definition (identifier) (parameters (typed_parameter (identifier) (type (identifier))))
    (body (pass_statement)))
  (function_definition (identifier) (parameters (typed_parameter (identifier) (type (identifier)))) (return_type (type (identifier)))
    (body (pass_statement)))
  (function_definition (identifier) (parameters (typed_default_parameter (identifier) (type (identifier)) (string)))
    (body (pass_statement)))
  (function_definition (identifier) (parameters (typed_default_parameter (identifier) (type (identifier)) (string))) (return_type (type (identifier)))
    (body (pass_statement))))

=====================================
Function Calls
=====================================

hello()
hello(world)
hello("world")
hello(1 + 1, "world")
hello(hello())
hello(hello("world"))

---

(source
  (expression_statement (call (identifier) (argument_list)))
  (expression_statement (call (identifier) (argument_list (identifier))))
  (expression_statement (call (identifier) (argument_list (string))))
  (expression_statement (call (identifier) (argument_list (binary_operator (integer) (integer)) (string))))
  (expression_statement (call (identifier) (argument_list (call (identifier) (argument_list)))))
  (expression_statement (call (identifier) (argument_list (call (identifier) (argument_list (string))))))
)

=====================================
Signal Statements
=====================================

signal x
signal x()
signal x(a, b)

---

(source
  (signal_statement (identifier))
  (signal_statement (identifier))
  (signal_statement (identifier) (identifier_list (identifier) (identifier))))

=====================================
Class Name
=====================================

class_name Name
class_name Name, "icon"

---

(source
  (class_name_statement (identifier))
  (class_name_statement (identifier) (class_name_icon_path)))

=====================================
Tool and Extend
=====================================

tool
extends "class/path"
extends "class/path".Attr
extends "class/path".Attr.Attr
extends Ident
extends Ident.Attr
extends Ident.Attr.Attr

---
(source
  (tool_statement)
  (extends_statement (string))
  (extends_statement (string) (dotted_name (identifier)))
  (extends_statement (string) (dotted_name (identifier) (identifier)))
  (extends_statement (dotted_name (identifier)))
  (extends_statement (dotted_name (identifier) (identifier)))
  (extends_statement (dotted_name (identifier) (identifier) (identifier))))

=====================================
Inner Class
=====================================

class Name:
  func hello(): pass

class Name extends Type:
  func hello(): pass

class Name:
  extends Type

---

(source
  (class_definition (identifier)
    (body
      (function_definition (identifier) (parameters)
        (body (pass_statement)))))
  (class_definition (identifier) (extends_statement (dotted_name (identifier)))
    (body
      (function_definition (identifier) (parameters)
        (body (pass_statement)))))
  (class_definition (identifier)
    (body
      (extends_statement (dotted_name (identifier))))))
